Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.IsToolOptionOn Method
 Determines whether select switch is on.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsToolOptionOn(
	string toolOptionName
)
Public Shared Function IsToolOptionOn (
	toolOptionName As String
) As Boolean
Parameters
toolOptionName
Type: System.String
Name of the switch.
Return Value
Type: Boolean
true if select switch is on; otherwise, false.
See Also
Reference
TeklaStructuresSettings Class
Tekla.Structures Namespace